Sep-15-backup-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-16 Sat 14:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lab 3 Notes</title>
<meta name="author" content="Tianyu Chen" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lab 3 Notes</h1>

<div id="outline-container-org9ecb3d7" class="outline-2">
<h2 id="org9ecb3d7">Merge Sort on <span class="underline">Linked Lists</span></h2>
<div class="outline-text-2" id="text-org9ecb3d7">
</div>
<div id="outline-container-org2124d75" class="outline-3">
<h3 id="org2124d75"><code>sort()</code>: functional merge sort</h3>
<div class="outline-text-3" id="text-org2124d75">
<ul class="org-ul">
<li><b>input:</b>   head node N</li>
<li><b>returns:</b> head node of the sorted list</li>

<li>if input is empty or only contains one node?
<ul class="org-ul">
<li>return N and we're done</li>
</ul></li>
<li>otherwise?
<ul class="org-ul">
<li>copy and drop the 1ˢᵗ half of the list</li>
<li>recursively sort the two halves</li>
<li>merge the two sorted halves together
and return the head</li>
</ul></li>
</ul>

<p>
What will list N be after sorting?
</p>


<p>
How to merge?
</p>
</div>

<div id="outline-container-org245d833" class="outline-4">
<h4 id="org245d833"><code>merge()</code></h4>
<div class="outline-text-4" id="text-org245d833">
<ul class="org-ul">
<li><b>input:</b> two sorted linked lists A B</li>
<li><b>returns:</b> sorted linked lists</li>

<li>if one of the input lists is empty?
<ul class="org-ul">
<li>return the other and we're done</li>
</ul></li>
<li>otherwise?
<ol class="org-ol">
<li>if A &lt;= B?
<ul class="org-ul">
<li>create <span class="underline">new node</span> with the data of A</li>
<li>the next node should be the head of
recursively merging A.next with B</li>
<li>return the new node</li>
</ul></li>
<li>otherwise?
<ul class="org-ul">
<li>create new node with the data of B</li>
<li>the next node should be the head of
recursively merging A with B.next</li>
<li>return the new node</li>
</ul></li>
</ol></li>
</ul>


<p>
<b>example:</b> merge <code>1 -&gt; 3 -&gt; 4 -&gt; 6 -&gt; 8</code> with
                 <code>2 -&gt; 4 -&gt; 5 -&gt; 7 -&gt; 9</code> ,
we get <code>1 -&gt; 2 -&gt; 3 -&gt; 4 -&gt; 4 -&gt; 5 -&gt; 6 -&gt; 7 -&gt; 8 -&gt; 9</code>
</p>
</div>
</div>
</div>


<div id="outline-container-org6f4eb6b" class="outline-3">
<h3 id="org6f4eb6b"><code>sort_in_place()</code>: in-place merge sort</h3>
<div class="outline-text-3" id="text-org6f4eb6b">
<ul class="org-ul">
<li>similar to <code>sort()</code></li>
<li>don't copy
<ul class="org-ul">
<li>instead find the middle node <code>mid</code></li>
<li>record the next node as the head of 2ⁿᵈ half,
break the link
<ul class="org-ul">
<li>example: <code>1 -&gt; 2 -&gt; 3 -&gt; 4 -&gt; 5</code></li>
</ul></li>
</ul></li>
<li>recursively sort two halves in-place</li>
<li>merge the result lists in-place and
return the head</li>
</ul>

<p>
How to merge?
</p>
</div>

<div id="outline-container-org1d98a2f" class="outline-4">
<h4 id="org1d98a2f"><code>merge_in_place()</code></h4>
<div class="outline-text-4" id="text-org1d98a2f">
<ul class="org-ul">
<li>similar to <code>merge()</code></li>
<li>don't create new node and copy data, instead:
<ul class="org-ul">
<li>suppose A is the smaller node</li>
<li>directly set the next node of A to be
the head of recursive merge</li>
<li>return A</li>
</ul></li>
</ul>


<p>
<b>example:</b> merge <code>1 -&gt; 3 -&gt; 4 -&gt; 6 -&gt; 8</code> with
                 <code>2 -&gt; 4 -&gt; 5 -&gt; 7 -&gt; 9</code> ,
we get <code>1 -&gt; 2 -&gt; 3 -&gt; 4 -&gt; 4 -&gt; 5 -&gt; 6 -&gt; 7 -&gt; 8 -&gt; 9</code>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-09-15 Fri 00:00</p>
<p class="author">Author: Tianyu Chen</p>
<p class="date">Created: 2023-09-16 Sat 14:17</p>
</div>
</body>
</html>